BomberStealth/OmniaPi_HomeDomotic_Firmware/led_strip/sdkconfig.defaults
# ESP32-S2 Mini configuration
CONFIG_IDF_TARGET="esp32s2"

# Flash size 4MB (ESP32-S2 Mini)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Console via USB CDC (ESP32-S2 native USB)
CONFIG_ESP_CONSOLE_USB_CDC=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# FreeRTOS tick rate
CONFIG_FREERTOS_HZ=1000

# Disable SoftAP (not needed)
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# Custom partition table for OTA support
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# RMT for LED strip (WS2812B)
CONFIG_RMT_ISR_IRAM_SAFE=y
